<?php
require_once '../lib/standard.php';
set_globals(TRUE);
Page::head();
?>
<style type="text/css">
p {
	background-image: none;
	background-color: #FFFFFF;
}

.mainArea {
	margin-top: 0px;
	margin-bottom: 0px;
	margin-left: 1.5cm;
	max-width: 20.0cm;
	line-height: 150%;
	text-align: justify;
	max-height: 13.8cm;
	min-height: 13.8cm;
	height: 13.8cm;
}

.dexia {
	text-align: right;
	font-style: italic;
}
</style>
<?php
Page::body();
Page::epikefalida(Globals::perastike('pedi'));
?>
<div class="mainArea">
<p class="dexia">
Θεσσαλονίκη, 25 Σεπτεμβρίου 2011
</p>
<p>
Ο ιστότοπος της διαδικτυακής πρέφας στήθηκε και
συντηρείται από εμένα προσωπικά, τόσο όσον αφορά
στην ανάπτυξη των σχετικών προγραμμάτων,
όσο και σε ό,τι αφορά στα έξοδα που απαιτούνται για την κατοχύρωση του
domain name (www.prefadoros.gr) και την ενοικίαση του
server. Επειδή τα απαιτούμενα ποσά δεν είναι ευκαταφρόνητα, ζητώ
τη συνδρομή των φίλων της ΔΠ, ώστε να μειώσω το σχετικό κόστος.
Η λειτουργία του site είναι εξασφαλισμένη μέχρι και τον Φεβρουάριο
του 2011, ενώ το ποσό που έχω ήδη καταβάλει ανέρχεται
περίπου στα 350€. Θα προσπαθήσω να κρατήσω τον ιστότοπο «ζωντανό»
με δικά μου έξοδα, αλλά η οικονομική κατάσταση στη χώρα μας
βαίνει από το κακό στο χειρότερο
και πιθανόν να μην μπορέσω να ανταποκριθώ, επομένως οποιαδήποτε
δωρεά είναι πολύτιμη.
</p>
<p>
Για να συνεισφέρετε στα έξοδα του Πρεφαδόρου,
έχω προσθέσει σχετικό κουμπάκι κάτω αριστεά (Donate)
με το οποίο μπορείτε να καταθέσετε οποιοδήποτε ποσό στο λογαριασμό
μου στο <a target="_blank" href="http://www.paypal.com">PayPal</a>.
Η κατάθεσή σας μπορεί να γίνει είτε μέσω πιστωτικής κάρτας, είτε
εκταμιεύοντας το σχετικό ποσό από τυχόν δικό σας PayPal λογαριασμό.
Η αμοιβή της PayPal είναι <span class="nobr">0.35€ + 3%</span> για κάθε πληρωμή,
επομένως αν καταθέσετε 10€,
θα «χαθούν» περίπου 0.65€, ενώ αν καταθέσετε 20€, θα «χαθούν» περίπου
0.95€. That's life…
</p>
<p class="dexia">
Με τιμή, Πάνος Παπαδόπουλος
</p>
</div>
<?php
Page::close();
?>
